// *++
//
// Copyright (c)  2007 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
// Module Name:
//
//   IScsiConfigStrings.uni
// 
// Abstract:
// 
//   String definitions for iSCSI configuration.
// 
// Revision History:
// 
// --*/


/=#

#langdef eng "English"

#string STR_ISCSI_CONFIG_FORM_TITLE     #language eng "iSCSI Configuration"  
#string STR_ISCSI_CONFIG_FORM_HELP      #language eng "Configure the iSCSI parameters."   
#string STR_ISCSI_MAIN_FORM_TITLE       #language eng "iSCSI Configuration"
#string STR_ISCSI_CONFIG_INIT_NAME      #language eng "iSCSI Initator Name"
#string STR_ISCSI_CONFIG_INIT_NAME_HELP #language eng "The worldwide unique name of the initiator. Only iqn. format is accepted."
#string STR_ISCSI_DEVICE_FORM_TITLE     #language eng ""
#string STR_ISCSI_DEVICE_ENABLE         #language eng "Enalbe iSCSI"
#string STR_ISCSI_LOCAL_IP_ADDRESS      #language eng "  Initator IP Address"
#string STR_ISCSI_LOCAL_MASK            #language eng "  Initiator Subnet Mask" 
#string STR_ISCSI_LOCAL_GATEWAY         #language eng "  GateWay"
#string STR_ISCSI_IP_ADDRESS_HELP       #language eng "Enter IP address in dotted-decimal notation."       
#string STR_ISCSI_TARGET_NAME           #language eng "  Target Name"     
#string STR_ISCSI_TARGET_IP_ADDRESS     #language eng "  Target IP Address"     
#string STR_ISCSI_TARGET_PORT           #language eng "  Target Port"     
#string STR_ISCSI_BOOT_LUN              #language eng "  Boot LUN"
#string STR_ISCSI_BOOT_LUN_HELP         #language eng "Hexadecimal representation of the LU number. Examples are: 4752-3A4F-6b7e-2F99, 6734-9-156f-127, 4186-9"
#string STR_ISCSI_ENABLE_DHCP           #language eng "Enable DHCP"         
#string STR_ISCSI_ENABLE_DHCP_ON_TARGET #language eng "Get target info via DHCP"
#string STR_CHAP_TYPE_PROMPT            #language eng "CHAP Type"
#string STR_CHAP_TYPE_HELP              #language eng "None, One way CHAP or mutual CHAP"
#string STR_CHAP_TYPE_NONE              #language eng "None"
#string STR_CHAP_TYPE_UNI               #language eng "One way"
#string STR_CHAP_TYPE_MUTUAL            #language eng "Mutual"
#string STR_ISCSI_CHAP_NAME             #language eng "  CHAP Name"
#string STR_ISCSI_CHAP_SECRET           #language eng "  CHAP Secret"
#string STR_ISCSI_CHAP_SECRET_HELP      #language eng "The minimum length is 12 bytes and the maximum length is 16 bytes."
#string STR_ISCSI_REVERSE_CHAP_NAME     #language eng "  Reverse CHAP Name"
#string STR_ISCSI_REVERSE_CHAP_SECRET   #language eng "  Reverse CHAP Secret"
#string STR_RETURN_MAIN_FORM            #language eng "Back to Previous Page"
#string STR_SAVE_CHANGES                #language eng "Save Changes"                 
#string STR_NULL                        #language eng ""
  